In [1]:
import pandas as pd
import yfinance as yf
import matplotlib.pyplot as plt
%matplotlib inline
import os

In [2]:
os.chdir(r"C:\Users\shwee\OneDrive\Desktop\Special Topics For Data Science\stock")

In [3]:
df = yf.download('IBM','2010-01-01','2018-12-31')
df.to_csv('ibm.csv')

[*********************100%***********************]  1 of 1 downloaded

In [4]:
df.head()

              Open    High     Low   Close  Adj Close   Volume
Date
2009-12-31  132.41  132.85  130.75  130.90      96.99  4223400
2010-01-04  131.18  132.97  130.85  132.45      98.14  6155300
2010-01-05  131.68  131.85  130.10  130.85      96.96  6841400
2010-01-06  130.68  131.49  129.81  130.00      96.33  5605300
2010-01-07  129.87  130.25  128.91  129.55      95.99  5840600

In [5]:
df2 = yf.download('AMZN','2010-01-01','2018-12-31')
df2.to_csv('AMZN.csv')

[*********************100%***********************]  1 of 1 downloaded

In [6]:
df2.head()

              Open    High     Low   Close  Adj Close    Volume
Date
2009-12-31  137.09  137.28  134.52  134.52     134.52   4523000
2010-01-04  136.25  136.61  133.14  133.90     133.90   7599900
2010-01-05  133.43  135.48  131.81  134.69     134.69   8851900
2010-01-06  134.60  134.73  131.65  132.25     132.25   7178800
2010-01-07  132.01  132.32  128.80  130.00     130.00  11030200

In [7]:
df3 = yf.download('ORCL','2010-01-01','2018-12-31')
df3.to_csv('Oracle.csv')

[*********************100%***********************]  1 of 1 downloaded

In [8]:
df3.head()

             Open   High    Low  Close  Adj Close    Volume
Date
2009-12-31  24.94  24.95  24.48  24.53      21.71  17714100
2010-01-04  24.66  25.19  24.66  24.85      21.99  26795000
2010-01-05  24.72  24.85  24.35  24.82      21.97  28669900
2010-01-06  24.77  24.92  24.38  24.46      21.65  24560700
2010-01-07  24.46  24.61  24.08  24.38      21.58  30469700

In [9]:
df4 = yf.download('INTC','2010-01-01','2018-12-31')
df4.to_csv('Intel.csv')

[*********************100%***********************]  1 of 1 downloaded

In [10]:
df4.head()

             Open   High    Low  Close  Adj Close    Volume
Date
2009-12-31  20.60  20.72  20.40  20.40      15.06  26429200
2010-01-04  20.79  21.03  20.73  20.88      15.41  47800900
2010-01-05  20.94  20.99  20.60  20.87      15.40  52357700
2010-01-06  20.81  20.93  20.67  20.80      15.35  40037400
2010-01-07  20.73  20.76  20.34  20.60      15.20  54041500

In [11]:
df5 = yf.download('FB','2010-01-01','2018-12-31')
df5.to_csv('FB.csv')

[*********************100%***********************]  1 of 1 downloaded

In [12]:
df5.head()

             Open   High    Low  Close  Adj Close     Volume
Date
2012-05-18  42.05  45.00  38.00  38.23      38.23  573576400
2012-05-21  36.53  36.66  33.00  34.03      34.03  168192700
2012-05-22  32.61  33.59  30.94  31.00      31.00  101786600
2012-05-23  31.37  32.50  31.36  32.00      32.00   73600000
2012-05-24  32.95  33.21  31.77  33.03      33.03   50237200

In [17]:
import os
import glob
import pandas as pd

In [18]:
extension = 'csv'
all_filenames = [i for i in glob.glob('*.{}'.format(extension))]

In [19]:
#combine all files in the list
combined_csv = pd.concat([pd.read_csv(f) for f in all_filenames ])
#export to csv
combined_csv.to_csv( "combined_csv.csv", index=False, encoding='utf-8-sig')